// Дано число обозначающее день недели. Выяснить является номер дня недели выходной


Console.WriteLine("Введите необходимый день недели: ");

int N = int.Parse(Console.ReadLine());

if (N == 1)
{
    Console.WriteLine("День недели под номером " + N + " : не является выходным днем");
}
else if (N == 2)
{
    Console.WriteLine("День недели под номером " + N + " : не является выходным днем");
}
else if (N == 3)
{
    Console.WriteLine("День недели под номером " + N + " : не является выходным днем");
}
else if (N == 4)
{
    Console.WriteLine("День недели под номером " + N + " : не является выходным днем");
}
else if (N == 5)
{
    Console.WriteLine("День недели под номером " + N + " : не является выходным днем");
}
else if (N == 6)
{
    Console.WriteLine("День недели под номером " + N + " : ВЫХОДНОЙ ДЕНЬ");
}
else if (N == 7)
{
    Console.WriteLine("День недели под номером " + N + " : ВЫХОДНОЙ ДЕНЬ");
}
else
{
     Console.WriteLine("Неправильно введен номер дня");
}